driver-tests/httpsoapbc/ssl/HttpSSLBpel/src/SymmetricSSLTest/Trigger.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/Trigger"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/Trigger" name="Trigger" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:file="http://schemas.sun.com/jbi/wsdl-extensions/file/">
    <wsdl:types/>
    <wsdl:message name="TriggerOperationRequest">
        <wsdl:part name="part1" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="TriggerOperationReply">
        <wsdl:part name="part1" type="xsd:string"/>
    </wsdl:message>
    <wsdl:portType name="TriggerPortType">
        <wsdl:operation name="TriggerOperation">
            <wsdl:input name="input1" message="tns:TriggerOperationRequest"/>
            <wsdl:output name="output1" message="tns:TriggerOperationReply"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="TriggerBinding" type="tns:TriggerPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="TriggerOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/Trigger"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/Trigger"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="TriggerService">
        <wsdl:port name="TriggerPort" binding="tns:TriggerBinding">
            <soap:address location="http://localhost:12121/TriggerService/TriggerPort"/>
        </wsdl:port>
    </wsdl:service>
    <plnk:partnerLinkType name="TriggerPartner">
        <!-- partnerLinkType are automatically generated when a new portType is added. partnerLinkType are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="TriggerPortTypeRole" portType="tns:TriggerPortType"/>
    </plnk:partnerLinkType>
    <plnk:partnerLinkType name="TriggerLink">
        <plnk:role name="TriggerRole" portType="tns:TriggerPortType"/>
    </plnk:partnerLinkType>
</definitions>
