driver-tests/httpsoapbc/HttpBCTests/HttpBCJbiPostXmlOut/test/SoapTriggerXmlHttpPostInOut2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trig="http://j2ee.netbeans.org/wsdl/Trigger">
  <soapenv:Body>
    <trig:TriggerOperation>
      <part1>
        <tns:Contact xmlns:tns="http://xml.netbeans.org/schema/XmlPostSchema">
          <tns:Identity>
              <tns:FirstName>Jennifer</tns:FirstName>
              <tns:LastName>Danneskold</tns:LastName>
          </tns:Identity>
          <tns:Locator>
              <tns:EmailAddress>jennifer.danneskold@seebeyond.com</tns:EmailAddress>
              <tns:OfficeAddress>800 E. Royal Oaks Drive, Monrovia, CA 91801</tns:OfficeAddress>
          </tns:Locator>
        </tns:Contact>
      </part1>
    </trig:TriggerOperation>
  </soapenv:Body>
</soapenv:Envelope>